Public Member Functions | List of all members
ACAPI::MEP::FlexibleSegment::Modifier Class Reference
MEP Element Manager
Modifier of the FlexibleSegment. More...
#include <MEPFlexibleSegment.hpp>
 Inheritance diagram for ACAPI::MEP::FlexibleSegment::Modifier:
 Public Member Functions
Result< void >  | Inject (const FlexibleSegmentDefault &flexibleSegmentDefault)
Injects the Default settings into the FlexibleSegment.
Result< void >  | SetControlPoints (const std::vector< API_Coord3D > &controlPoints)
Sets the FlexibleSegment's geometry to a spline.
Result< void >  | SetPolyline (const FlexibleSegmentPolyline &polyline)
Sets the FlexibleSegment's geometry to a polyline.
Result< void >  | SetWidth (double width)
Sets the width of the FlexibleSegment.
Result< void >  | SetHeight (double height)
Sets the height of the FlexibleSegment.
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
Modifier (ModifiableElementBase &parent)
Constructs a Modifier with the parent ModifiableElementBase.
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the FlexibleSegment.
Member Function Documentation
◆ Inject()
 Result< void > ACAPI::MEP::FlexibleSegment::Modifier::Inject  |  ( |  const FlexibleSegmentDefault & |  flexibleSegmentDefault | )
Injects the Default settings into the FlexibleSegment.
Parameters
flexibleSegmentDefault | The Default what will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ SetControlPoints()
 Result< void > ACAPI::MEP::FlexibleSegment::Modifier::SetControlPoints  |  ( |  const std::vector< API_Coord3D > & |  controlPoints | )
Sets the FlexibleSegment's geometry to a spline.
Parameters
controlPoints | The control points of the spline to be set.
Returns
Returns an error if the points are invalid, for example:
Control points are empty.
Two adjacent points at the same location.
◆ SetHeight()
 Result< void > ACAPI::MEP::FlexibleSegment::Modifier::SetHeight  |  ( |  double |  height | )
Sets the height of the FlexibleSegment.
Parameters
height | The value to be set.
Returns
Returns an error if the height is not positive, otherwise nothing.
◆ SetPolyline()
 Result< void > ACAPI::MEP::FlexibleSegment::Modifier::SetPolyline  |  ( |  const FlexibleSegmentPolyline & |  polyline | )
Sets the FlexibleSegment's geometry to a polyline.
Parameters
polyline | The polyline to be set.
Returns
Returns an error if the polyline is invalid, for example:
Polyline is empty.
Adjacent segments are of the same type.
Adjacent starting/ending points don't connect.
Setting polyline geometry on a Ventillation FlexibleSegment.
◆ SetWidth()
 Result< void > ACAPI::MEP::FlexibleSegment::Modifier::SetWidth  |  ( |  double |  width | )
Sets the width of the FlexibleSegment.
Parameters
width | The value to be set.
Returns
Returns an error if the width is not positive, otherwise nothing.